YCSB-master/resultados/dbleiAux-WorkloadE-2500.log
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl com.yahoo.ycsb:dblei-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
java -cp /home/jose/Desktop/LEI/Key-DocumentDB/YCSB-master/dblei/conf:/home/jose/Desktop/LEI/Key-DocumentDB/YCSB-master/dblei/target/dblei-binding-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/jose/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/home/jose/.m2/repository/org/rocksdb/rocksdbjni/5.11.3/rocksdbjni-5.11.3.jar:/home/jose/.m2/repository/net/jcip/jcip-annotations/1.0/jcip-annotations-1.0.jar:/home/jose/Desktop/LEI/Key-DocumentDB/YCSB-master/core/target/core-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/jose/Desktop/LEI/Key-DocumentDB/DB/target/bd-serverless-1.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.dblei.DBLEIClient -P workloads/workloade -p operationcount=2500 -s -t
Command line: -db com.yahoo.ycsb.db.dblei.DBLEIClient -P workloads/workloade -p operationcount=2500 -s -t
YCSB Client 0.16.0-SNAPSHOT

Loading workload...
Starting test.
2019-07-02 12:51:11:626 0 sec: 0 operations; est completion in 0 second 
Vou conectar ao spread
[Thread-3] WARN io.atomix.cluster.messaging.impl.NettyMessagingService - Disabling TLS for intra-cluster messaging; Could not load cluster key store: ../config/atomix.jks (No such file or directory)
[netty-messaging-event-epoll-server-0] INFO io.atomix.cluster.messaging.impl.NettyMessagingService - localhost/127.0.0.1 accepting incoming connections on port 30734
[netty-messaging-event-epoll-server-0] INFO io.atomix.cluster.messaging.impl.NettyMessagingService - Started
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
java.lang.Exception: Não existem mais
java.lang.Exception: Não existem mais
java.lang.Exception: Não existem mais
[...]
2019-07-02 12:51:21:608 10 sec: 1054 operations; 105,4 current ops/sec; est completion in 14 seconds [INSERT: Count=755, Max=5227, Min=452, Avg=979,25, 90=1264, 99=2281, 99.9=4859, 99.99=5227] [SCAN: Count=300, Max=159871, Min=19760, Avg=29041,71, 90=34431, 99=57631, 99.9=159871, 99.99=159871] 
java.lang.Exception: Não existem mais
java.lang.Exception: Não existem mais
java.lang.Exception: Não existem mais
[...]
2019-07-02 12:51:31:608 20 sec: 2202 operations; 114,8 current ops/sec; est completion in 3 second [INSERT: Count=806, Max=6907, Min=471, Avg=903,42, 90=1150, 99=2373, 99.9=6859, 99.99=6907] [SCAN: Count=341, Max=37375, Min=17776, Avg=27107,4, 90=31583, 99=35999, 99.9=37375, 99.99=37375] 
java.lang.Exception: Não existem mais
java.lang.Exception: Não existem mais
java.lang.Exception: Não existem mais
[...]
[ForkJoinPool.commonPool-worker-1] INFO io.atomix.cluster.messaging.impl.NettyMessagingService - Stopped
2019-07-02 12:51:36:371 24 sec: 2500 operations; 62,57 current ops/sec; [CLEANUP: Count=1, Max=2254847, Min=2252800, Avg=2253824, 90=2254847, 99=2254847, 99.9=2254847, 99.99=2254847] [INSERT: Count=211, Max=1418, Min=467, Avg=828,43, 90=1126, 99=1290, 99.9=1418, 99.99=1418] [SCAN: Count=87, Max=38047, Min=18352, Avg=26780,23, 90=32031, 99=36479, 99.9=38047, 99.99=38047] 
[OVERALL], RunTime(ms), 24763
[OVERALL], Throughput(ops/sec), 100.95707305253806
[TOTAL_GCS_PS_Scavenge], Count, 77
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 142
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.5734361749384161
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 77
[TOTAL_GC_TIME], Time(ms), 142
[TOTAL_GC_TIME_%], Time(%), 0.5734361749384161
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2253824.0
[CLEANUP], MinLatency(us), 2252800
[CLEANUP], MaxLatency(us), 2254847
[CLEANUP], 95thPercentileLatency(us), 2254847
[CLEANUP], 99thPercentileLatency(us), 2254847
[INSERT], Operations, 1772
[INSERT], AverageLatency(us), 926.8024830699774
[INSERT], MinLatency(us), 452
[INSERT], MaxLatency(us), 6907
[INSERT], 95thPercentileLatency(us), 1307
[INSERT], 99thPercentileLatency(us), 2281
[INSERT], Return=OK, 1772
[SCAN], Operations, 728
[SCAN], AverageLatency(us), 27865.406593406595
[SCAN], MinLatency(us), 17776
[SCAN], MaxLatency(us), 159871
[SCAN], 95thPercentileLatency(us), 35231
[SCAN], 99thPercentileLatency(us), 50431
[SCAN], Return=OK, 728
dblei-binding
CENAS
['java', '-cp', '/home/jose/Desktop/LEI/Key-DocumentDB/YCSB-master/dblei/conf:/home/jose/Desktop/LEI/Key-DocumentDB/YCSB-master/dblei/target/dblei-binding-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/home/jose/.m2/repository/org/slf4j/slf4j-api/1.7.25/slf4j-api-1.7.25.jar:/home/jose/.m2/repository/org/rocksdb/rocksdbjni/5.11.3/rocksdbjni-5.11.3.jar:/home/jose/.m2/repository/net/jcip/jcip-annotations/1.0/jcip-annotations-1.0.jar:/home/jose/Desktop/LEI/Key-DocumentDB/YCSB-master/core/target/core-0.16.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/home/jose/Desktop/LEI/Key-DocumentDB/DB/target/bd-serverless-1.0-SNAPSHOT.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.4/jackson-mapper-asl-1.9.4.jar:/home/jose/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar', 'com.yahoo.ycsb.Client', '-db', 'com.yahoo.ycsb.db.dblei.DBLEIClient', '-P', 'workloads/workloade', '-p', 'operationcount=2500', '-s']
FIM